#+TITLE: VAST Fits
#+PROPERTY: header-args :tangle yes

** [2020-08-05 Wed]
Looking back at these results to see where the non-PD Hessian is coming from in
fits 2 and 3 here. Could not get above code to run with latest version of VAST.
"NOT A VECTOR!" warning from TMB for some reason.

#+BEGIN_SRC R :session *R-vast*
sdr1 <- readRDS("VAST-run/vast_sdr_2020-04-17T13:24.RData")
sdr2 <- readRDS("VAST-run/vast_sdr_2020-04-22T10:05.RData")
sdr3 <- readRDS("VAST-run/vast_sdr_2020-04-22T10:26.RData ")

eig1 <- eigen(sdr1$cov.fixed)
eig2 <- eigen(sdr2$cov.fixed)
eig3 <- eigen(sdr3$cov.fixed)
#+END_SRC

#+RESULTS:
|    -3772.99190091845 |
|     38.6590165589487 |
|     2.02060065850653 |
|   0.0963698880669193 |
|  0.00833326613450672 |
|  0.00817087032635617 |
|  0.00811804970388517 |
|  0.00810496176646841 |
|  0.00807890498478738 |
|  0.00801136335567165 |
|  0.00799942814953216 |
|  0.00799640724106876 |
|  0.00797194335829657 |
|   0.0079344403244212 |
|  0.00790499127239198 |
|  0.00789284307030435 |
|  0.00787686790874847 |
|  0.00785359374890457 |
|  0.00783506682204719 |
|  0.00782199521231538 |
|  0.00778112530508233 |
|   0.0077598495017162 |
|  0.00769057797717946 |
|  0.00764384716652228 |
|   0.0076155003758428 |
|  0.00759736778418465 |
|  0.00753527843554946 |
|  0.00750045949475921 |
|  0.00498504560564399 |
|  0.00127609038786829 |
| 0.000569654232721966 |
| 0.000569218406382989 |
| 0.000562398087122355 |
|  0.00056212139012409 |
| 0.000561043403113236 |
| 0.000560447362899587 |
| 0.000559050068104373 |
| 0.000556652401923491 |
| 0.000556226993864434 |
| 0.000555686754984075 |
| 0.000555610600692517 |
| 0.000555553995269227 |
| 0.000555322904833738 |
| 0.000555101312568083 |
| 0.000554969774229765 |
| 0.000554926725682745 |
| 0.000554702721216551 |
| 0.000554469842210872 |
| 0.000554143635021089 |
| 0.000553848139410038 |
| 0.000553831287401504 |
| 0.000553760611714883 |
|  0.00055347692671633 |
| 0.000553021135086747 |
| 8.94717835138555e-06 |

#+BEGIN_SRC R
parnames <- names(sdr1$par.fixed)
parnames[rank(eig2$vectors[, 1])]
#+END_SRC

#+RESULTS:
